OpenNuvoton/nuc1263bsp/SampleCode/StdDriver/SPDH_LLSIDevice/LLSI/LED_Control.c
/******************************************************************************//**
 * @file     Serial_Stripe.c
 * @version  V1.00
 * @brief    Serial Stripe lighting effects sample file
 *
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

/*!<Includes */
#include <stdlib.h>
#include <stdio.h>
#include "NuMicro.h"
#include "LED_Control.h"
#include "Device.h"
#include "HDIV.h"
#include "Global_Variable.h"
#include "Flash.h"

#define printf(...)


/* Initial Serial LED Data Array */
__attribute__((aligned (4))) uint8_t Strip1LEDData[(cStrip1_LED * 3)];

/* Initial Receive LED Data Array */
__attribute__((aligned (4))) uint8_t au8RcvBuffer[(cStrip1_LED * 3)];

/* Initial Strip1 Setting */
__attribute__((aligned (4))) volatile LED_Setting_T Strip1_LEDSetting = {0, 0, cStrip1_LED, 1, 255, 0, 0, 0xFF, 0x80, Dir_Forward, Type_GRB,
                                                                         1, 1, 0, FUNC_Static, Strip1LEDData, 0, 0, 0, Music_POP, 0, (cStrip1_LED*3)};

volatile uint8_t s_u8StopFlashLED = 1;
uint8_t g_u8OneShot_Flag = 0;

volatile LED_Setting_T *PDMA_Mapping[1] = {&Strip1_LEDSetting};

/* Lighting Effect Mode */
void * const Mode_Function[16] = {(void *)FUNC_Off, (void *)FUNC_Static, (void *)FUNC_Breathing, (void *)FUNC_Strobe, (void *)FUNC_Cycling,
                                  (void *)FUNC_Random, (void *)FUNC_Off, (void *)FUNC_Wave, (void *)FUNC_Spring, (void *)FUNC_Off,
                                  (void *)FUNC_Off, (void *)FUNC_Off, (void *)FUNC_Off, (void *)FUNC_Water, (void *)FUNC_Rainbow, (void *)FUNC_Double_Strobe};

uint8_t LLSI_FlashLEDRoutine(void);

#define BreathingArraySize 150
const uint8_t BreathingBright[BreathingArraySize]	= {  0,   0,   0,   0,   1,   1,   2,   3,   4,   5,
                                                         7,   8,  10,  11,  13,  15,  17,  19,  21,  23,
                                                        25,  28,  30,  32,  35,  37,  40,  42,  45,  47,
                                                        50,  52,  55,  57,  60,  62,  65,  67,  70,  72,
                                                        75,  77,  79,  81,  83,  85,  87,  89,  90,  92,
                                                        93,  95,  96,  97,  98,  99,  99, 100, 100, 100,
                                                       100, 100, 100, 100, 100,  99,  99,  98,  97,  96,
                                                        95,  93,  92,  90,  89,  87,  85,  83,  81,  79,
                                                        77,  75,  72,  70,  67,  65,  62,  60,  57,  55,
                                                        52,  50,  47,  45,  42,  40,  37,  34,  32,  30,
                                                        28,  25,  23,  21,  19,  17,  15,  13,  11,  10,
                                                         8,   7,   5,   4,   3,   2,   1,   1,   0,   0,
                                                         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
                                                         0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
                                                         0,   0,   0,   0,   0,   0,   0,   0,   0,   0};

/* Number of LED for each mode */
#define cMeteor_LED 4

#define RainbowSize	8
const uint8_t RainbowColor[RainbowSize][3]    // (R, G, B)
              = {{255,   0,   0},		// Red
                 {255,  85,   0},		// Orange
                 {255, 255,   0},		// Yellow
                 {  0, 255,   0},		// Green
                 {  0, 127, 255},		// Cyan
                 {  0,   0, 255},		// Blue
                 {127,   0, 255},		// Indigo
                 {255,   0, 255}};      // Purple

void LLSI_Initial(void)
{
    /* Unlock write-protected registers */
    SYS_UnlockReg();

    /* Enable module clock */
    CLK_EnableModuleClock(PDMA_MODULE);
    CLK_EnableModuleClock(LLSI0_MODULE);
    CLK_EnableModuleClock(TMR0_MODULE);
    /*---------------------------------------------------------------------------------------------------------*/
    /* Init I/O Multi-function                                                                                 */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Set LLSI multi-function pin */
    LLSI0_MFP_Setting();    // Strip1

    /* Set LLSI configuration */
    //LLSI_Open(LLSI0, LLSI_MODE_SW, LLSI_FORMAT_GRB, SystemCoreClock, 1250, 400, 850, 50000, cStrip1_LED, LLSI_IDLE_LOW);
    LLSI_Open(LLSI0, LLSI_MODE_SW, LLSI_FORMAT_RGB, SystemCoreClock, 1200, 300, 900, 50000, cStrip1_LED, LLSI_IDLE_LOW);

    /* Enable reset command function */
    LLSI_ENABLE_RESET_COMMAND(LLSI0);

    /* Enable Reset command interrupt */
    LLSI_EnableInt(LLSI0, LLSI_RSTC_INT_MASK);

    /* Enable NVIC for LLSI */
    NVIC_EnableIRQ(LLSI0_IRQn);

    /* Reset PDMA module */
    SYS_ResetModule(PDMA_RST);
    /* Open Channel 0 */
    PDMA_Open(0x1);

    /* PDMA Setting for LLSI */
    /* Transfer type is single transfer */
    PDMA_SetBurstType(0, PDMA_REQ_SINGLE, 0);
    /* Set source address, destination address */
    PDMA_SetTransferAddr(0, (uint32_t)Strip1LEDData, PDMA_SAR_INC, (uint32_t)&LLSI0->DATA, PDMA_DAR_FIX);

    /* Lock protected registers */
    SYS_LockReg();
}

void LLSI0_IRQHandler(void)
{
    if(!PDMA_Mapping[0]->fPDMA_Done)
    {
        PDMA_Mapping[0]->fPDMA_Done = 1;
        LLSI_SET_SW_MODE(LLSI0);
    }

    /* Clear interrupt flag */
    LLSI_ClearIntFlag(LLSI0, LLSI_RSTC_INT_MASK);
}

void Set_Single(uint8_t *LED_DATA, uint32_t TotalLED, uint8_t Data_R, uint8_t Data_G, uint8_t Data_B)
{
    uint32_t i;

    for(i = 0; i < TotalLED; i++)
    {
        *(LED_DATA + i*3 + 0) = Data_R;
        *(LED_DATA + i*3 + 1) = Data_G;
        *(LED_DATA + i*3 + 2) = Data_B;
    }
}

void Set_Array(uint8_t *LED_DATA, uint32_t TotalLED, uint8_t *DisplayData, uint8_t MaxBright)
{
    uint32_t i;
    uint8_t TempR, TempG, TempB;

    for(i = 0; i < TotalLED; i++)
    {
        TempR = HDIV_Div(*(DisplayData + i*3 + 0) * MaxBright, 0xFF);
        TempG = HDIV_Div(*(DisplayData + i*3 + 1) * MaxBright, 0xFF);
        TempB = HDIV_Div(*(DisplayData + i*3 + 2) * MaxBright, 0xFF);
        *(LED_DATA + i*3 + 0) = TempR;
        *(LED_DATA + i*3 + 1) = TempG;
        *(LED_DATA + i*3 + 2) = TempB;
    }
}

