OpenNuvoton/nuc1263bsp/SampleCode/StdDriver/SPDH_LLSIDevice/LLSI/LED_Control.c
void Set_InverseArray(uint8_t *LED_DATA, uint32_t TotalLED, uint8_t *DisplayData, uint8_t MaxBright)
{
    uint32_t i, j;
    uint8_t TempR, TempG, TempB;

    for(i = 0, j = TotalLED-1; i < TotalLED; i++, j--)
    {
        TempR = HDIV_Div(*(DisplayData + j*3 + 0) * MaxBright, 0xFF);
        TempG = HDIV_Div(*(DisplayData + j*3 + 1) * MaxBright, 0xFF);
        TempB = HDIV_Div(*(DisplayData + j*3 + 2) * MaxBright, 0xFF);
        *(LED_DATA + i*3 + 0) = TempR;
        *(LED_DATA + i*3 + 1) = TempG;
        *(LED_DATA + i*3 + 2) = TempB;
    }
}

void Set_LED_Data(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t u32Count;

    /* Calculate transfer count */
    u32Count = LED_Setting->Array_Size / 4;
    if(LED_Setting->Array_Size % 4)
        u32Count++;

    /* Set transfer count */
    PDMA_SetTransferCnt(LED_Setting->LLSI_Num, PDMA_WIDTH_32, u32Count);
    /* Set request source */
    PDMA_SetTransferMode(LED_Setting->LLSI_Num, 36 + LED_Setting->LLSI_Num, FALSE, 0);    // PDMA_LLSI0 = 36
    /* Change LLSI mode */
    LLSI_SET_PDMA_MODE((LLSI_T *)(APB1_BASE + 0x100000*(LED_Setting->LLSI_Num%2) + 0x54000 + 0x200*(LED_Setting->LLSI_Num/2)));

    /* Clear done flag */
    LED_Setting->fPDMA_Done = 0;
}

void Clear_LED_Data(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t i;

    for(i = 0; i < LED_Setting->Array_Size; i++)
    {
        LED_Setting->LED_Data[i] = 0x0;
    }

    /* Set data */
    Set_LED_Data(LED_Setting);
}

void LLSI_WriteData(uint16_t u16ByteSel, uint8_t u8Data)
{
    if (u16ByteSel < (sizeof(Strip1LEDData)/sizeof(uint8_t)))
    {
        /* debug log */
        printf("[LLSI_WriteData][%d]ByteSel: %d(0x%x), data: %d(0x%x)\n", Strip1_LEDSetting.LEDNum, u16ByteSel, u16ByteSel, u8Data, u8Data);
        *(au8RcvBuffer + u16ByteSel) = u8Data;
    }
    else
    {
        printf("[ERR][LLSI_WriteData][%d]ByteSel: %d(0x%x) Over buffer size ~~\n", Strip1_LEDSetting.LEDNum, u16ByteSel, u16ByteSel);
    }
}

void LLSI_WriteBlockData(uint16_t u16ByteLen, uint8_t *pu8Data)
{
#if 1
    volatile uint32_t i;
    
    for (i=0; i<u16ByteLen; i++)
        *(au8RcvBuffer + i) = pu8Data[i];
#else    
    uint32_t u32Idx, u32Idx1;
    /* debug log */
    printf("[LLSI_WriteBlockData]%d\n", u16ByteLen);
    
    u16ByteLen <<= 1;
    /* LED even and odd number both use the same data. */
    for (u32Idx = 0; u32Idx < u16ByteLen; u32Idx+=3)
    {
        if (u32Idx < 3)
        {
            u32Idx1 = u32Idx;
            *(au8RcvBuffer + u32Idx1) = *(pu8Data + u32Idx);
            *(au8RcvBuffer + u32Idx1 + 1) = *(pu8Data + u32Idx + 1);
            *(au8RcvBuffer + u32Idx1 + 2) = *(pu8Data + u32Idx + 2);
            *(au8RcvBuffer + u32Idx1 + 3) = *(pu8Data + u32Idx);
            *(au8RcvBuffer + u32Idx1 + 3 + 1) = *(pu8Data + u32Idx + 1);
            *(au8RcvBuffer + u32Idx1 + 3 + 2) = *(pu8Data + u32Idx + 2);
            //printf("%d, %d\n", u32Idx, u32Idx1);
        }
        else
        {
            u32Idx1 = u32Idx * 2;
            *(au8RcvBuffer + u32Idx1) = *(pu8Data + u32Idx);
            *(au8RcvBuffer + u32Idx1 + 1) = *(pu8Data + u32Idx + 1);
            *(au8RcvBuffer + u32Idx1 + 2) = *(pu8Data + u32Idx + 2);
            *(au8RcvBuffer + u32Idx1 + 3) = *(pu8Data + u32Idx);
            *(au8RcvBuffer + u32Idx1 + 3 + 1) = *(pu8Data + u32Idx + 1);
            *(au8RcvBuffer + u32Idx1 + 3 + 2) = *(pu8Data + u32Idx + 2);
            //printf("%d, %d\n", u32Idx, u32Idx1);        
        }
    }
    /* debug log */
    for (u32Idx = 0; u32Idx < u16ByteLen; u32Idx++)
    {
        printf("[%d]%d ", u32Idx, *(au8RcvBuffer + u32Idx));
    }
    printf("\n");
#endif    
}

static void TIMER0_Initial(void)
{
    static uint8_t u8Timer0InitDone = 0;
    
    if (u8Timer0InitDone != 0)
        return ;
    
    /* Open Timer0 in periodic mode, enable interrupt and 1 interrupt tick per 1 ms */
    TIMER_Open(TIMER0, TIMER_PERIODIC_MODE, 1000);
    TIMER_EnableInt(TIMER0);

    /* Enable Timer0 NVIC */
    NVIC_EnableIRQ(TMR0_IRQn);
    
    TIMER_Start(TIMER0);
    
    u8Timer0InitDone = 1;
}

void TMR0_IRQHandler(void)
{
    /* Clear interrupt flag */
    TIMER_ClearIntFlag(TIMER0);

    /* Add LED mode counter */
    Strip1_LEDSetting.TimeCounter++;
    
    if ((Strip1_LEDSetting.TimeCounter&0x1F) == 0)
    {
        Strip1_LEDSetting.LLSI_Trigger = 1;
    }
}

void LLSI_StartFlashLED(uint8_t u8LLSIEnable)
{
    if (u8LLSIEnable)
    {
        printf("[LLSI_StartFlashLED] start\n");
        s_u8StopFlashLED = 0;
        
        Strip1_LEDSetting.TimeCounter = 0;
        
        /* Set Timer configuration */
        TIMER0_Initial();
        
        /* Use TIMER0 counter as seed of random function */
        srand(TIMER0->CNT);

        /* Set CMP value to clear TIMER0 CNT to 0 */
        TIMER_SET_CMP_VALUE(TIMER0, TIMER0->CMP);
#if 0
        /* Clear Color Data */
        Clear_LED_Data(&Strip1_LEDSetting);
#endif
        
        LLSI_FlashLEDRoutine();
    }
    else
    {
        printf("[LLSI_StartFlashLED] stop\n");

        /* Stop Flash LED. */
        s_u8StopFlashLED = 1;

    }
}

/* return s_u8StopFlashLED value. */
uint8_t LLSI_FlashLEDRoutine(void)
{
#if 0
    uint32_t i;
#endif
    if (s_u8StopFlashLED == 1)
    {
        /* Below code does not be executed to write LLSI data. */
        return s_u8StopFlashLED;
    }

    printf("[LLSI_FlashLEDRoutine][%d] start\n", Strip1_LEDSetting.LEDNum);
    
    /* Serial LED Control */
    if(Strip1_LEDSetting.fPDMA_Done)
    {
        printf("[LLSI_FlashLEDRoutine] PDMA_Done\n");
        if(Strip1_LEDSetting.AP_Sync == 1)
        {
            printf("[LLSI_FlashLEDRoutine] AP_Sync\n");

            /* Mapping Color to LED Format */
            Set_Array(Strip1_LEDSetting.LED_Data, Strip1_LEDSetting.LEDNum, (uint8_t *)(au8RcvBuffer), 0x1F);

            /* Set LED data */
            Set_LED_Data(&Strip1_LEDSetting);

            if(g_u8Strip1_Flash_OneShot == 1)
            {
                /* Clear done flag */
                Strip1_LEDSetting.fPDMA_Done = 0;

                /* One shot operation has done. */
                s_u8StopFlashLED = 1;

                printf("[LLSI_FlashLEDRoutine] stop(L:%d)\n", __LINE__);
                return s_u8StopFlashLED;
            }
        }
        else
        {
            printf("\n\t[LLSI_FlashLEDRoutine] g_u8Strip1_Flash_OneShot:%d, g_u8OneShot_Flag:%d\n", g_u8Strip1_Flash_OneShot, g_u8OneShot_Flag);
            if(g_u8Strip1_Flash_OneShot && g_u8OneShot_Flag == 1)
            //if(g_u8Strip1_Flash_OneShot)
            {
                /* Clear done flag */
                Strip1_LEDSetting.fPDMA_Done = 0;

                /* One shot operation has done. */
                s_u8StopFlashLED = 1;

