OpenNuvoton/nuc1263bsp/SampleCode/StdDriver/SPDH_LLSIDevice/LLSI/LED_Control.c
            #if 0
                /* set LED strip to stop flashing */
                CLK_SysTickDelay(100000);

                for(i = 0; i < Strip1_LEDSetting.LEDNum * 3; i++)
                {
                    *(Strip1_LEDSetting.LED_Data + i) = 0x0;
                }
            #endif
                /* Strip 1 LED data */
                Strip1_LEDSetting.Mode_FUNC(&Strip1_LEDSetting);

                /* Set LED data */
                Set_LED_Data(&Strip1_LEDSetting);

                g_u8OneShot_Flag = 0;
                printf("[LLSI_FlashLEDRoutine] stop(L:%d)\n", __LINE__);
                return s_u8StopFlashLED;
            }else
            {
                if(Strip1_LEDSetting.LLSI_Trigger)
                {
                    /* Clear done flag */
                    Strip1_LEDSetting.fPDMA_Done = 0;
                    Strip1_LEDSetting.LLSI_Trigger = 0;

                    /* Strip 1 LED data */
                    Strip1_LEDSetting.Mode_FUNC(&Strip1_LEDSetting);

                    /* Set LED data */
                    Set_LED_Data(&Strip1_LEDSetting);
                    printf("[LLSI_FlashLEDRoutine] stop(L:%d)\n", __LINE__);                    
                }

                return s_u8StopFlashLED;
            }
        }
    }

    return s_u8StopFlashLED;
}

/*------Lighting Mode-----------------------------------------*/
void FUNC_Off(volatile struct LED_Setting_Tag* LED_Setting)
{
    printf("\n\tFUNC_Off\n");
    /* Mapping Color to LED Format */
    Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, 0, 0, 0);
    g_u8OneShot_Flag = 1;
}

void FUNC_Static(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t TempR, TempG, TempB;
    printf("\n\tFUNC_Static\n");
    /* Calculate Color */
    TempR = HDIV_Div((LED_Setting->Color_R * LED_Setting->Brightness), 0xFF);
    TempG = HDIV_Div((LED_Setting->Color_G * LED_Setting->Brightness), 0xFF);
    TempB = HDIV_Div((LED_Setting->Color_B * LED_Setting->Brightness), 0xFF);

    /* Mapping Color to LED Format */
    Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, TempR, TempG, TempB);

    g_u8OneShot_Flag = 1;
}

void FUNC_Breathing(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t Temp, TempR, TempG, TempB;
    printf("\n\tFUNC_Breathing\n");
    /* Calculate Color */
    Temp = HDIV_Mod(HDIV_Div(LED_Setting->TimeCounter, 8 + HDIV_Div(LED_Setting->Speed, 10)), BreathingArraySize);
    TempR = HDIV_Div((LED_Setting->Color_R * LED_Setting->Brightness * *(BreathingBright + Temp)), 0xFF*100);
    TempG = HDIV_Div((LED_Setting->Color_G * LED_Setting->Brightness * *(BreathingBright + Temp)), 0xFF*100);
    TempB = HDIV_Div((LED_Setting->Color_B * LED_Setting->Brightness * *(BreathingBright + Temp)), 0xFF*100);

    /* Mapping Color to LED Format */
    Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, TempR, TempG, TempB);

    /* Reset CountingTime */
    if(LED_Setting->TimeCounter >= ((8 + HDIV_Div(LED_Setting->Speed, 10)) * BreathingArraySize))
    {
        LED_Setting->TimeCounter -= (8 + HDIV_Div(LED_Setting->Speed, 10)) * BreathingArraySize;

        g_u8OneShot_Flag = 1;
    }
}

void FUNC_Strobe(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t TempR, TempG, TempB;
    printf("\n\tFUNC_Strobe\n");
    /* Reset CountingTime */
    while(LED_Setting->TimeCounter >= (((5 * LED_Setting->Speed) + 275) * 2))
    {
        LED_Setting->TimeCounter -= (((5 * LED_Setting->Speed) + 275) * 2);

        g_u8OneShot_Flag = 1;
    }

    /* Extinguish */
    if(LED_Setting->TimeCounter < ((5 * LED_Setting->Speed) + 275))
    {
        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, 0, 0, 0);
    }
    /* Lighten */
    else
    {
        /* Calculate Color */
        TempR = HDIV_Div((LED_Setting->Color_R * LED_Setting->Brightness), 0xFF);
        TempG = HDIV_Div((LED_Setting->Color_G * LED_Setting->Brightness), 0xFF);
        TempB = HDIV_Div((LED_Setting->Color_B * LED_Setting->Brightness), 0xFF);

        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, TempR, TempG, TempB);
    }
}

void FUNC_Cycling(volatile struct LED_Setting_Tag* LED_Setting)
{
    static uint8_t u8ColorIndex = eColorRed;
    printf("\n\tFUNC_Cycling\n");
    /* Reset CountingTime */
    if (LED_Setting->TimeCounter >= (500 + LED_Setting->Speed*10))
    {
        LED_Setting->TimeCounter -= (500 + LED_Setting->Speed*10);

        /* Switch to next color state. */
        if(u8ColorIndex == eColorRed)
        {
            u8ColorIndex = eColorGreen;
        }
        else if(u8ColorIndex == eColorGreen)
        {
            u8ColorIndex = eColorBlue;

            g_u8OneShot_Flag = 1;
        }
        else if(u8ColorIndex == eColorBlue)
        {
            u8ColorIndex = eColorRed;
        }
    }

    /* Mapping Color to LED Format */
    Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, HDIV_Div((RainbowColor[u8ColorIndex][0] * LED_Setting->Brightness), 0xFF), \
                                                           HDIV_Div((RainbowColor[u8ColorIndex][1] * LED_Setting->Brightness), 0xFF), \
                                                           HDIV_Div((RainbowColor[u8ColorIndex][2] * LED_Setting->Brightness), 0xFF));
}

void FUNC_Random(volatile struct LED_Setting_Tag* LED_Setting)
{
    static uint8_t u8RandColorIndex = eColorRed;
    uint8_t temp;
    printf("\n\tFUNC_Random\n");
    /* Reset CountingTime */
    if (LED_Setting->TimeCounter >= (500 + LED_Setting->Speed*10))
    {
        LED_Setting->TimeCounter -= (500 + LED_Setting->Speed*10);

        /* Calculate next random color state. */
        /* If next state is same as current state, random again. */
        do
        {
            temp = ((RainbowSize * (rand() % 1024)) / 1024);
        }while(temp == u8RandColorIndex);
        /* Set next color state index. */
        u8RandColorIndex = temp;

        g_u8OneShot_Flag = 1;
    }

    /* Mapping Color to LED Format */
    Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, HDIV_Div((RainbowColor[u8RandColorIndex][0] * LED_Setting->Brightness), 0xFF), \
                                                           HDIV_Div((RainbowColor[u8RandColorIndex][1] * LED_Setting->Brightness), 0xFF), \
                                                           HDIV_Div((RainbowColor[u8RandColorIndex][2] * LED_Setting->Brightness), 0xFF));
}

void FUNC_Music(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t i;
    uint32_t j;
    uint8_t POP_Color[3] = {0};
    uint32_t Unit_Volume = HDIV_Div((LED_Setting->Main_Volume * LED_Setting->LEDNum), 100);
    uint8_t JAZZ_Display[LED_Setting->LEDNum][3];

    printf("\n\tFUNC_Music\n");
    /* Init Array */
    for(j = 0; j < LED_Setting->LEDNum; j++)
    {
        for(i = 0; i < 3; i++)
            JAZZ_Display[j][i] = 0;
    }

    /* POP */
    if(LED_Setting->Music_Action == Music_POP)
    {
        printf("\n\tFUNC_Music: POP\n");
        for(i = 0; i < 3; i++)
        {
            POP_Color[i] = HDIV_Div(RainbowColor[eColorBlue][i] * (100 - LED_Setting->Main_Volume), 100)\
                           + HDIV_Div(RainbowColor[eColorRed][i] * LED_Setting->Main_Volume, 100);

            if(i == 2)
                g_u8OneShot_Flag = 1;
        }

        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, HDIV_Div((POP_Color[0] * LED_Setting->Brightness), 0xFF), \
                                                               HDIV_Div((POP_Color[1] * LED_Setting->Brightness), 0xFF), \
                                                               HDIV_Div((POP_Color[2] * LED_Setting->Brightness), 0xFF));
    }
    /* JAZZ */
    else if(LED_Setting->Music_Action == Music_JAZZ)
    {
        printf("\n\tFUNC_Music: JAZZ\n");
        for(j = 0; j < Unit_Volume; j++)
        {
            for(i = 0; i < 3; i++)
            {
                JAZZ_Display[j][i] = *(&LED_Setting->Color_R + i);
            }
        }

        /* Mapping Color to LED Format */
        /* Direction forward or backward */
        if(LED_Setting->Direction == Dir_Forward)
            Set_Array(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)JAZZ_Display, LED_Setting->Brightness);
        else if(LED_Setting->Direction == Dir_Backward)
            Set_InverseArray(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)JAZZ_Display, LED_Setting->Brightness);
    }
    /* Mixed */
    else if (LED_Setting->Music_Action == Music_Mixed)
    {
        printf("\n\tFUNC_Music: Mixed\n");
        for(i = 0; i < 3; i++)
        {
            POP_Color[i] = HDIV_Div(RainbowColor[eColorBlue][i] * (100 - LED_Setting->Main_Volume), 100)\
                           + HDIV_Div(RainbowColor[eColorRed][i] * LED_Setting->Main_Volume, 100);
        }

        for(j = 0; j < Unit_Volume; j++)
        {
            for(i = 0; i < 3; i++)
            {
                JAZZ_Display[j][i] = POP_Color[i];
            }
        }

        /* Mapping Color to LED Format */
        /* Direction forward or backward */
        if(LED_Setting->Direction == Dir_Forward)
            Set_Array(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)JAZZ_Display, LED_Setting->Brightness);
        else if(LED_Setting->Direction == Dir_Backward)
            Set_InverseArray(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)JAZZ_Display, LED_Setting->Brightness);
    }
}

void FUNC_Wave(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t i;
    uint32_t DeltaT = 800 + LED_Setting->Speed*4;
    uint32_t CurrentTime;
    uint8_t Color1[3];
    uint8_t Color2[3];
    uint8_t DisplayColor[3];
    uint32_t Temp;
    printf("\n\tFUNC_Wave\n");
    if(LED_Setting->Direction == Dir_Forward)
    {
        /* Take Color1 and Color2 from Rainbow array by TimeCounter */
        Temp = HDIV_Mod(HDIV_Div(LED_Setting->TimeCounter, DeltaT), RainbowSize);
        for(i = 0; i < 3; i++)
        {
            /* Set Color1 */
            Color1[i] = RainbowColor[Temp][i];
            /* Set Color2 */
            Color2[i] = RainbowColor[HDIV_Mod((Temp+1), RainbowSize)][i];
        }
    }
    else if(LED_Setting->Direction == Dir_Backward)
    {
        /* Take Color1 and Color2 from Rainbow array by TimeCounter */
        Temp = HDIV_Mod(HDIV_Div(LED_Setting->TimeCounter, DeltaT), RainbowSize);
        for(i = 0; i < 3; i++)
        {
            /* Set Color1 */
            Color1[i] = RainbowColor[RainbowSize - 1 - Temp][i];
            /* Set Color2 */
            Color2[i] = RainbowColor[HDIV_Mod((RainbowSize + RainbowSize - 2 - Temp), RainbowSize)][i];
        }
    }

    /* Reset CountingTime */
    if(LED_Setting->TimeCounter >= (DeltaT * RainbowSize))
    {
        LED_Setting->TimeCounter -= (DeltaT * RainbowSize);

        g_u8OneShot_Flag = 1;
    }

    /* Judge current time and set mixed Displaycolor by color1 and color2 */
    CurrentTime = HDIV_Mod(LED_Setting->TimeCounter, DeltaT);
    for(i = 0; i < 3; i++)
        DisplayColor[i] = HDIV_Div(Color1[i] * (DeltaT - CurrentTime), DeltaT) + HDIV_Div(Color2[i] * CurrentTime, DeltaT);

    /* Mapping Color to LED Format */
    Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, DisplayColor[0], DisplayColor[1], DisplayColor[2]);
}

