OpenNuvoton/nuc1263bsp/SampleCode/StdDriver/SPDH_LLSIDevice/LLSI/LED_Control.c
void FUNC_Spring(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint8_t DisplayColor[LED_Setting->LEDNum+2*cMeteor_LED][3];
    uint32_t i;
    uint32_t j;
    uint8_t Color[cMeteor_LED][3];
    uint32_t Duration;
    uint32_t Loop, DeltaT, DelayT;
    uint32_t TempColor;
    printf("\n\tFUNC_Spring\n");
    /* Init Array */
    for(j = 0; j < LED_Setting->LEDNum+2*cMeteor_LED; j++)
    {
        for(i = 0; i < 3; i++)
            DisplayColor[j][i] = 0;
    }

    /* DeltaT is unit time */
    DeltaT = 5 + HDIV_Div(LED_Setting->Speed, 20);
    /* Duration is one time pass through */
    Duration = DeltaT * (LED_Setting->LEDNum + cMeteor_LED * 2);
    /* DelayT is delay on two ends */
    DelayT = HDIV_Div(LED_Setting->LEDNum * DeltaT, 2);
    /* Reset CountingTime */
    if(LED_Setting->TimeCounter >= (2 * (Duration + DelayT)))
    {
        LED_Setting->TimeCounter -= 2 * (Duration + DelayT);
    }

    /* Forward */
    if(LED_Setting->TimeCounter < Duration)
    {
        /* Loop to indicate which LED for first Color */
        Loop = HDIV_Div(LED_Setting->TimeCounter, DeltaT);

        for(i = 0; i < 3; i++)
        {
            TempColor = *(&LED_Setting->Color_R + i);

            /* 1st 100%*/
            Color[0][i] = TempColor;
            /* 2nd 75% */
            Color[1][i] = (TempColor * 3) >> 2;
            /* 3rd 50% */
            Color[2][i] = TempColor >> 1;
            /* 4th 25% */
            Color[3][i] = TempColor >> 2;
        }

        for(j = Loop; j < (Loop + cMeteor_LED); j++)
        {
            for(i = 0; i < 3; i++)
                DisplayColor[j][i] = Color[j - Loop][i];
        }
    }
    /* All Extinguish */
    else if(LED_Setting->TimeCounter < (Duration + DelayT) )
    {
        for(j = 0; j < LED_Setting->LEDNum+2*cMeteor_LED; j++)
        {
            for(i = 0; i < 3; i++)
                DisplayColor[j][i] = 0;
        }
    }
    else if(LED_Setting->TimeCounter < (2*Duration + DelayT))
    {
        /* Loop to indicate which LED for first Color */
        Loop = HDIV_Div(LED_Setting->TimeCounter - (Duration + DelayT), DeltaT);

        for(i = 0; i < 3; i++)
        {
            TempColor = *(&LED_Setting->Color_R + i);

            /* 1st 25%*/
            Color[0][i] = TempColor >> 2;
            /* 2nd 50% */
            Color[1][i] = TempColor >> 1;
            /* 3rd 75% */
            Color[2][i] = (TempColor * 3) >> 2;
            /* 4th 100% */
            Color[3][i] = TempColor;
        }

        for(j = (LED_Setting->LEDNum + cMeteor_LED - Loop); j < (LED_Setting->LEDNum + cMeteor_LED - Loop + cMeteor_LED); j++)
        {
            for(i = 0; i < 3; i++)
                DisplayColor[j][i] = Color[j - (LED_Setting->LEDNum + cMeteor_LED - Loop)][i];
        }
    }
    /* All Extinguish */
    else
    {
        for(j = 0; j < LED_Setting->LEDNum+2*cMeteor_LED; j++)
        {
            for(i = 0; i < 3; i++)
                DisplayColor[j][i] = 0;
        }

        g_u8OneShot_Flag = 1;
    }

    /* Mapping Color to LED Format */
    /* Direction forward or backward */
    if(LED_Setting->Direction == Dir_Forward)
        Set_Array(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)(DisplayColor+cMeteor_LED), LED_Setting->Brightness);
    else if(LED_Setting->Direction == Dir_Backward)
        Set_InverseArray(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)(DisplayColor+cMeteor_LED), LED_Setting->Brightness);
}

void FUNC_Water(volatile struct LED_Setting_Tag* LED_Setting)
{
    const uint8_t Brightness[4] = {100, 15, 5, 15};
    const uint8_t MeteorNum = 4;
    static uint8_t u8ColorIndex = eColorRed;
    uint32_t i, j, Cursor;
    uint8_t DisplayColor[LED_Setting->LEDNum][3], Color[3];
    uint32_t MotionPeriod, TimeInPhase, PhasePeriod;
    printf("\n\tFUNC_Water\n");
    PhasePeriod = 1000 + LED_Setting->Speed * 4;
    MotionPeriod = HDIV_Div(PhasePeriod, 8);
    TimeInPhase = HDIV_Mod(LED_Setting->TimeCounter, PhasePeriod);

    /* Reset CountingTime */
    if (LED_Setting->TimeCounter >= PhasePeriod)
    {
        LED_Setting->TimeCounter -= PhasePeriod;

        /* If color index is overflow, reset color index. */
        u8ColorIndex = (u8ColorIndex >= (RainbowSize - 1)) ? eColorRed : (u8ColorIndex + 1);

        if(u8ColorIndex == (RainbowSize - 1))
            g_u8OneShot_Flag = 1;
    }


    /* Set Mixed Color = Color1 + Color2 */
    for(i = 0; i < 3; i++)
    {
        Color[i] = HDIV_Div(RainbowColor[u8ColorIndex][i] * (PhasePeriod - TimeInPhase), PhasePeriod)\
                + HDIV_Div(RainbowColor[HDIV_Mod((u8ColorIndex + 1), RainbowSize)][i] * TimeInPhase, PhasePeriod);
    }

    /* Calculate the cursor for moving the Brightness */
    Cursor = HDIV_Mod(HDIV_Div(LED_Setting->TimeCounter, MotionPeriod), MeteorNum);

    /* Sets the Light Bar array and modified the brightness for meteor effect. */
    for(j = 0; j < LED_Setting->LEDNum; j++)
    {
        for(i = 0; i< 3; i++)
        {
            DisplayColor[j][i] = HDIV_Div(Color[i] * Brightness[HDIV_Mod((Cursor + j), MeteorNum)], 100);
        }
    }

    /* Mapping Color to LED Format */
    /* Direction forward or backward */
    if(LED_Setting->Direction == Dir_Forward)
        Set_InverseArray(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)DisplayColor, LED_Setting->Brightness);
    else if(LED_Setting->Direction == Dir_Backward)
        Set_Array(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)DisplayColor, LED_Setting->Brightness);
}

void FUNC_Rainbow(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint8_t DisplayColor[LED_Setting->LEDNum][3];
    uint32_t i, j;
    uint32_t deltaT, TotalDuration, CurrentTime, NextTime;
    uint8_t ColorCursor1, ColorCursor2;
    printf("\n\tFUNC_Rainbow\n");
    /* Init Array */
    for(j = 0; j < LED_Setting->LEDNum; j++)
    {
        for(i = 0; i < 3; i++)
            DisplayColor[j][i] = 0;
    }

    /* Duration for one time effect */
    TotalDuration = HDIV_Div(60 * 1000, HDIV_Div(255 - LED_Setting->Speed, 3) + 5);
    /* Next LED time */
    NextTime = HDIV_Div(TotalDuration, 60);
    /* Current Time */
    CurrentTime = HDIV_Mod(LED_Setting->TimeCounter, TotalDuration);
    /* Unit time for each color */
    deltaT = HDIV_Div(TotalDuration, RainbowSize);

    /* Reset CountingTime */
    if(LED_Setting->TimeCounter >= TotalDuration)
    {
        LED_Setting->TimeCounter -= TotalDuration;

        g_u8OneShot_Flag = 1;
    }

    /* Mix Color */
    for(j = 0; j < LED_Setting->LEDNum; j++, CurrentTime += NextTime)
    {
        if(CurrentTime >= TotalDuration)
            CurrentTime -= TotalDuration;

