OpenNuvoton/nuc1263bsp/SampleCode/StdDriver/SPDH_LLSIDevice/LLSI/LED_Control.c
        if(CurrentTime >= (deltaT * RainbowSize))
        {
            /* Color Cursor */
            ColorCursor1 = 0;
            ColorCursor2 = 1;

            for(i = 0; i < 3; i++)
            {
                DisplayColor[LED_Setting->LEDNum-j-1][i] = RainbowColor[ColorCursor1][i];
            }
        }
        else
        {
            /* Color Cursor */
            ColorCursor1 = HDIV_Mod(HDIV_Div(CurrentTime, deltaT), RainbowSize);
            ColorCursor2 = HDIV_Mod((ColorCursor1 + 1), RainbowSize);

            for(i = 0; i < 3; i++)
            {
                DisplayColor[LED_Setting->LEDNum-j-1][i] = HDIV_Div(((RainbowColor[ColorCursor1][i] * ((ColorCursor1 + 1) * deltaT - CurrentTime)) + \
                                                           (RainbowColor[ColorCursor2][i] * (CurrentTime - ColorCursor1 * deltaT))), deltaT);
            }
        }
    }

    /* Mapping Color to LED Format */
    /* Direction forward or backward */
    if(LED_Setting->Direction == Dir_Forward)
        Set_Array(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)DisplayColor, LED_Setting->Brightness);
    else if(LED_Setting->Direction == Dir_Backward)
        Set_InverseArray(LED_Setting->LED_Data, LED_Setting->LEDNum, (uint8_t *)DisplayColor, LED_Setting->Brightness);
}

void FUNC_Double_Strobe(volatile struct LED_Setting_Tag* LED_Setting)
{
    uint32_t TempR, TempG, TempB;
    printf("\n\tFUNC_Double_Strobe\n");
    /* Reset CountingTime */
    while(LED_Setting->TimeCounter >= (((5 * LED_Setting->Speed) + 275) * 6))
    {
        LED_Setting->TimeCounter -= (((5 * LED_Setting->Speed) + 275) * 6);

        g_u8OneShot_Flag = 1;
    }

    /* Extinguish */
    if(LED_Setting->TimeCounter < ((5 * LED_Setting->Speed) + 275))
    {
        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, 0, 0, 0);
    }
    /* Lighten */
    else if((((5 * LED_Setting->Speed) + 275) <= LED_Setting->TimeCounter) && (LED_Setting->TimeCounter < (((5 * LED_Setting->Speed) + 275) * 2)))
    {
        /* Calculate Color */
        TempR = HDIV_Div((LED_Setting->Color_R * LED_Setting->Brightness), 0xFF);
        TempG = HDIV_Div((LED_Setting->Color_G * LED_Setting->Brightness), 0xFF);
        TempB = HDIV_Div((LED_Setting->Color_B * LED_Setting->Brightness), 0xFF);

        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, TempR, TempG, TempB);
    }
    /* Extinguish */
    else if(((((5 * LED_Setting->Speed) + 275) * 2) <= LED_Setting->TimeCounter) && (LED_Setting->TimeCounter < (((5 * LED_Setting->Speed) + 275) * 3)))
    {
        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, 0, 0, 0);
    }
    /* Lighten */
    else if(((((5 * LED_Setting->Speed) + 275) * 3) <= LED_Setting->TimeCounter) && (LED_Setting->TimeCounter < (((5 * LED_Setting->Speed) + 275) * 4)))
    {
        /* Calculate Color */
        TempR = HDIV_Div((LED_Setting->Color_R * LED_Setting->Brightness), 0xFF);
        TempG = HDIV_Div((LED_Setting->Color_G * LED_Setting->Brightness), 0xFF);
        TempB = HDIV_Div((LED_Setting->Color_B * LED_Setting->Brightness), 0xFF);

        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, TempR, TempG, TempB);
    }
    /* Extinguish */
    else
    {
        /* Mapping Color to LED Format */
        Set_Single(LED_Setting->LED_Data, LED_Setting->LEDNum, 0, 0, 0);
    }
}
